# 4. 확률분포

# 4.1 확률변수
# 표본공간에서 정의된 함수, 흔히 X, Y, Z로 표혐
# 확률변수 X는 표본공간의 각 단위사건에 실수값을 부여하는 함수

# 4.1.1 이산확률변수
# 확률변수 X가 취할 수 있는 값이 유한개 또는 자연수와 일대일 대응이 되는 무한개일 경우의 확률변수 X
# 즉, 확률변수 X가 취할 수 있는 값을 X1, ..., Xk라 하면 f(xi) = P(X = xi), i = 1, ..., k를 확률분포라 함
# 조건
# 1) f(xi) > 0, i = 1, ..., k (모든 확를은 0 이상이어야 함)
# 2) sum(f(xi)) = 1 (모든 확률의 합은 1)

# 4.1.2 연속확률변수
# 확률변수 X가 일정구간의 모든 실수 값을 가질 수 있으면 이를 연속확률변수라 함
# ex) 사람의 나이, 몸무게 등.. (실제로는 모든 실수값을 가짐)

# 확률밀도함수의 성질
# 1) f(x) >= 0
# 2) int(f(x)dx) = 1 (면적의 합 = 1)

# 확률밀도함수의 여러가지 형태
# 균일모양(uniform), 종모양(bell-shaped), 왼편으로 긴 꼬리 모양(skewed to the left), 오른편으로 긴 꼬리모양(skewed to the right)

